Revit 2027 API
RoutingPreferenceManager.GetNumberOfRules Method
 The number of RoutingPreference rules in a group.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetNumberOfRules(
	RoutingPreferenceRuleGroupType eGroupType
)
Public Function GetNumberOfRules (
	eGroupType As RoutingPreferenceRuleGroupType
) As Integer
public:
int GetNumberOfRules(
	RoutingPreferenceRuleGroupType eGroupType
)
member GetNumberOfRules :
        eGroupType : RoutingPreferenceRuleGroupType -> int
Parameters
eGroupType RoutingPreferenceRuleGroupType
Return Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RoutingPreferenceManager Class
Autodesk.Revit.DB Namespace